// ignore_for_file: public_member_api_docs, sort_constructors_first
import 'package:flutter/material.dart';

class PublicOfferWidget extends StatelessWidget {
  const PublicOfferWidget({
    super.key,
    this.fontSize,
  });

  final double? fontSize;

  final text = '''

Для проекта Cashblack интересы пользователей превыше всего. Этот принцип лежит в основе всех принимаемых нами решений, в том числе при сборе и обработке Ваших персональных данных.
Мы постарались сделать Политику конфиденциальности как можно более понятной и ясной. Наша цель заключается в том, чтобы Вы — пользователь Cashblack — всегда чувствовали себя уверенно, когда речь заходит о конфиденциальности.
Сохранение Вашего доверия также является одним из приоритетов Cashblack. Для защиты  конфиденциальности Ваших персональных данных используются указанные ниже принципы.

1. Собираемые данные о Вас
Политика конфиденциальности Cashblack распространяется на всех пользователей Приложения Cashblack App и посетителей сайта (далее - пользователи сервисов). Если Вас беспокоит или не устраивает сам факт предоставления нам Вами информации, возможность отображения данной информации в сервисах Cashblack либо использование такой информации иными способами в соответствии с настоящей Политикой конфиденциальности и Пользовательским соглашением, Вам не следует становиться пользователем сервисов Cashblack и посещать наш сайт. 
Сбор персональных данных осуществляется указанными ниже способами.

1.1. Регистрация и вход в сервисы без создания аккаунта
Создавая аккаунт в Приложении Cashblack App, Вы сообщаете нам личные данные, включая свое имя пользователя и пароль. Вы также можете указать номер телефона или электронную почту. Даже если вход не выполнен, Вы по желанию можете сообщить нам какие-то сведения о себе, например, адрес электронной почты, чтобы получать новости наших сервисов.
Для создания аккаунта в Cashblack App необходимо сообщить как минимум следующие данные: имя, фамилия, телефон, адрес электронной почты, адрес регистрации, пароль. В процессе регистрации Вы можете указать и другие сведения (например, пол, регион, город, дату рождения). Эти дополнительные сведения используются для предоставления персонализированных услуг, например, показ профилей, обновлений и контента на Вашем родном языке, рекомендации заведений, которые могут быть Вам интересны, расположенные рядом с местом Вашего нахождения. Всё это может отображаться в профиле Cashblack App, доступном для просмотра другим Пользователям и Клиентам. Вы принимаете условие, что, создавая аккаунт, Вы разрешаете Cashblackиспользовать предоставленные данные в соответствии с Пользовательским соглашением.
Если Вы не выполнили вход в аккаунт Приложения, мы регистрируем информацию, которую собираем с помощью уникальных идентификаторов, которые связаны с браузерами, приложениями и устройствами. Это позволяет нам запоминать Ваши настройки и другие данные, чтобы Вам не приходилось указывать их заново при новом входе.
Если Вы выполнили вход, мы собираем и сохраняем в аккаунте информацию, которую обрабатываем как личные данные. Даже если Вы не выполнили вход в аккаунт Приложения, у Вас имеется возможность управлять информацией, связанной с Вашим устройством и браузером, например, настройки предпочтений.

1.2. Данные учетной записи в Backoffice.
Вы можете добавить в учетную запись следующие сведения: номер телефона, адрес почтового ящика, фотографию учетной записи.
Мы также собираем контент, который Вы создаете, загружаете или получаете от других пользователей при использовании нашего продукта. К нему относятся письма, фотографии, которые Вы сохраняете, документы, автором которых Вы являетесь, Ваши комментарии и т.д.
Мы регистрируем информацию о браузерах и устройствах, которые Вы используете для доступа к Сервисам Приложения. Это обеспечивает работу таких функций, как автоматическое обновление Приложения.
Кроме этого, мы собираем такие данные, как тип и настройки браузера и устройства, операционная система, мобильная сеть (включая название оператора и номер телефона) и номер версии Приложения. Нами также регистрируется информация о взаимодействии Ваших приложений, браузеров и устройств с нашими сервисами, в том числе IP-адрес, отчеты о сбоях, сведения о действиях в системе, дата и время, когда Вы посетили наш ресурс, и URL, с которого Вы на него перешли (URL, перехода).
Эти данные мы получаем, когда Приложение с Вашего устройства обращается к нашим серверам, например, при установке Приложения из PlayMarket/AppStore или проверке на наличие обновлений.
В настройках учетной записи Вы можете откорректировать объем предоставляемых персональных данных, а также внести изменения. Более того, Вы можете выбрать какие сведения будут видны другим пользователям Приложения. В личном кабинете Приложения Вы можете управлять информацией, связанной с определенными продуктами. В настройках аккаунта Вы можете управлять своей контактной информацией - в нее входит Ваше имя, пол, адрес электронной почты, номер телефона и другие данные.

1.3. Информация о Вашем местоположении
Мы собираем информацию о Вашем местоположении, когда Вы пользуетесь Приложением, чтобы Вам были доступны такие функции, как скидки в ближайших кафе или магазинах поблизости.
Мы определяем Ваше местоположение с максимальной точностью, в соответствии с возможностями Вашего устройства, а также учитывая следующие факторы: сведения об объектах вокруг Вас, данные GPS, MAC-адрес. Типы данных о Вашем местоположении частично зависят от настроек Вашего устройства и аккаунта. Например, Вы можете отключить или включить на своем смартфоне или планшете геолокацию, а в параметрах аккаунта — историю местоположений.

1.4. Служба поддержки
Когда Вы обращаетесь в службу поддержки, Cashblack осуществляет сбор данных, чтобы ответить на Ваши вопросы и повысить качество обслуживания.
При обращении в службу поддержки, Cashblack собирает информацию, которая помогает классифицировать вопросы и отвечать на них, а также при необходимости расследовать случаи нарушения условий Пользовательского соглашения или настоящей Политики конфиденциальности. Эта информация также используется для выявления потенциальных проблем, отслеживания тенденций и повышения качества ответов службы поддержки.

1.5. Использование Сервисов Cashblack
Cashblack осуществляет сбор данных при посещении Вами нашего сайта, работе в приложениях Cashblack для мобильных устройств и при взаимодействии с объявлениями в Cashblack.
Cashblack осуществляет сбор данных, когда Вы используете наш сайт, Приложение Cashblack App. Cashblack осуществляет сбор данных, когда Вы просматриваете рекомендуемые объявления или переходите по ним, присоединяетесь к группам, участвуете в опросах, устанавливаете мобильное Приложение Cashblack App.

1.6. Использование сторонних служб и посещение сторонних сайтов
Cashblack осуществляет сбор данных, когда Вы используете аккаунт Cashblack App для входа на другие сайты или в другие службы. Cashblack получает информацию, когда Вы используете аккаунт Cashblack для входа в систему на стороннем сайте или в стороннем приложении.

1.7. Персонализация
В личном кабинете Вы можете предусмотреть согласие с тем, что Ваши данные могут быть использованы в целях более точной персонализации контента, в том числе повышении релевантности результатов поиска и отображаемых рекомендаций.
Вы можете выбирать какие объявления следует Вам показывать в Приложении. В настройках аккаунта можно редактировать информацию о себе, разрешать или запрещать использование Вашей личной информации для подбора рекомендуемого контента, а также блокировать некоторые источники объявлений.

1.8. Файлы журналов, IP-адреса и информация о компьютере или мобильном устройстве
Cashblack осуществляет сбор данных с устройств и сетей, через которые Вы подключаетесь к Cashblack. Эта информация помогает повысить качество и безопасность Услуг и Продуктов.

2. Цели сбора данных
Считаем необходимым оповестить Вас о том, что в целях валидации чеков средствами, Клиенты имеют возможность интеграции Приложения Cashblack App со сторонними сервисами. В таком случае при безналичной оплате мы как сервис осуществляем перевод дальнейшего взаимодействия на сторонние сервисы, которые могут получать доступ к Вашим платежным данным. Сам сервис Cashblack не собирает сведения о банковских картах Пользователей.
Cashblack собирает пользовательские данные для того, чтобы наши сервисы были более удобными. Благодаря этому мы не только определяем на каком языке Вы задали запрос, но решаем более сложные задачи, например, автоматически подбираем полезные места, магазины, ссылки на интересные материалы. Типы данных, которые мы собираем, зависит от того, как Вы используете Приложение и какие настройки конфиденциальности заданы в Вашем аккаунте.
Мы также можем получать информацию о Вас от доверенных лиц, к которым относятся партнеры, которые предоставляют нам сведения о потенциальных клиентах нашего Приложения, и сотрудники отдела безопасности, которые информируют нас по вопросам профилактики злоупотреблений. Кроме того, рекламодатели делятся с нами определенной информацией, которая необходима для проведения маркетинговых исследований и показа объявлений.
Для получения и хранения данных мы применяем различные технологии, такие как файлы cookie, локальные хранилища.
В работе наших сервисов мы так же используем личную информацию пользователей, которая помогает обрабатывать поисковые запросы, поступающие от Вас. Данная информация необходима, в том числе, для обеспечения стабильной работы сервисов и для их оптимизации, которая помогает отслеживать сбои в системе.
Без Вашего согласия мы не передаем в целях рекламы Ваш адрес электронной почты либо иные личные данные (например, Ваш номер телефона или имя), за исключением случаев, предусмотренных данной Политикой конфиденциальности. Мы используем личную информацию, такую как адрес электронной почты, для коммуникации с Вами. К примеру, мы можем отправлять оповещения о подозрительных попытках входа в аккаунт с новых устройств и изменениях в нашем продукте. Когда Вы обращаетесь к нам, Ваши сообщения сохраняются, чтобы мы могли решить проблему быстрее. Информация, которую мы собираем, важна для обеспечения надежности и безопасности нашего сервиса. Таким образом, мы можем своевременно выявлять и блокировать угрозы, чтобы не позволить злоумышленникам нанести вред Приложению и Пользователям.

3. Передача данных третьим лицам
Cashblack защищает Ваши персональные данные и предоставляет их третьим лицам только в случаях, определенных настоящей Политикой:
1. при наличии Вашего согласия или указания; 
2. когда это требуется для выполнения Ваших инструкций; 
3. когда это необходимо для предоставления Вам услуг и функциональности сервисов, в случаях и целях, указанных в настоящей Политике. Например, мы передаем Ваши данные о местоположении, уникальный идентификатор сервисам Google, при входе на карту, предоставляемую данным сервисом, для того, чтобы Google смог рассчитать расстояние до выбранной компании;
4. в соответствии с требованиями законодательства;
5. и для приведения в исполнение условий Пользовательского соглашения Cashblack либо для защиты прав, собственности и безопасности Cashblack, участников или общественности.

3.1. Для чего мы передаем данные
В целях изучения тенденций использования нашего сервиса мы можем предоставлять Ваши персональные данные иным лицам, таким как Клиенты (владельцам CRM-систем Cashblack), внешние вспомогательные сервисы (например, google maps, sdk), различные социальные сети (для авторизации), разработчики и правообладатели. В таком случае вся предоставляемая информация является агрегированной, предоставляемой в статистических целях. Кроме того, мы разрешаем отдельным партнерам собирать информацию из Вашего браузера или устройства с помощью собственных файлов cookie и иных технологий и использовать ее для показа рекомендуемого контента и оценки его эффективности. Такой сбор информации регулируется Политикой конфиденциальности каждого отдельного 
партнера.

3.2 Для обеспечения предоставления Вам услуг мы предоставляем Ваши персональные данные:
Клиентам. Это необходимо для предоставления Вам скидок и доступа к продуктам компании. Каждая компания, зарегистрированная в нашей системе для участия в системе лояльности, имеет доступ к Вашим данным, опубликованным в профиле. 
Сторонним вспомогательным сервисам и партнерам, обеспечивающим надлежащее функционирование наших сервисов:
Данные о местоположении передаются сервисам Google для обеспечения функционирования сервиса и формирования маршрута до выбранной компании.
Для анализа данных и улучшения наших сервисов мы используем такие сервисы как Google Analytics, crash-сервисы, получающие доступ к Вашим действиям, которые привели к тем или иным анализируемым последствиям. Например, в случае непредвиденной ошибки в приложении мы отправляем отчет о последних действиях для предотвращения возникновения подобной ошибки в дальнейшем.
Социальные сети получают данные о Вашей регистрации в нашем Приложении при входе с их помощью в наши сервисы.
Для возможности отправки Вам push-уведомлений мы используем вспомогательные сервисы, которые получают доступ к Вашим данным и отправляет Вам уведомления с Вашего разрешения. 
Аффилированным лицам Cashblack, которые не являются непосредственными обработчиками Ваших данных, если это необходимо для предоставления услуг.
Для реализации дополнительных функций, таких как установка аватара в личном кабинете, Вы можете загрузить изображение, для чего потребуется доступ к Вашей библиотеке изображений сервису загрузки изображения.
Для более эффективного предоставления своих услуг, Клиенты имеют возможность интегрировать безналичную оплату. При осуществлении такой оплаты, она проводится через сторонние сервисы, которые могут получать доступ к Вашим платежным данным.
Данные платежной карты сохраняются и передаются в соответствии с основными стандартами конфиденциальности и безопасности кредитных и дебетовых карт согласно PCI DSS (Стандарт безопасности данных платежных карт). Данные платежной карты не запрашиваются и не используются для каких-либо целей, не связанных с оплатой товаров и услуг. Данные платежной карты не хранятся на сервере.
Вы обязуетесь никому не раскрывать каким-либо способом личные данные клиента или информацию о платежной карте и транзакции — за исключением банка-эквайера и платежных систем Visa/Mastercard или по требованию органов государственной власти.
Политика конфиденциальности должна включать SSL, TLS или другую безопасностьданных, а также информацию о несоблюдении данных карты клиента.
Продавец должен добавить заявление «Торговец не будет продавать, покупать, предоставлять, обменивать или иным образом раскрывать данные Учетной записи или Транзакции, или личную информацию о Владельце карты или о нем кому-либо, за исключением случаев, когда он является эквайрером, корпорацией Visa/Mastercard Corporation или ответ на действующие требования правительства.

3.3 Предоставление данных в рамках судебного процесса и в иных 
предусмотренных законом случаях
Cashblack может предоставлять Ваши персональные данные при вызове в суд или в 
соответствии с требованиями другого юридического процесса, а также в случаях, когда это 
требуется для приведения в исполнение условий Пользовательского соглашения.
Возможна ситуация, когда Cashblack будет обязан раскрыть персональные данные, 
информацию, указанную в профиле, и/или сведения об активности в качестве участника Cashblack 
при вызове в суд или в соответствии с требованиями другого юридического процесса, а 
также в случаях, когда Cashblack имеет основания полагать, что раскрытие информации 
необходимо для:
1. расследования, предотвращения или принятия мер против предполагаемых или 
фактических правонарушений либо в помощь государственным правоохранительным 
органам;
2. приведения в исполнение условий Пользовательского соглашения, для 
расследования любых исков или обвинений третьих лиц и защиты от них либо для 
обеспечения безопасности и целостности Cashblack;
3. в осуществления или защиты прав, собственности или безопасности Cashblack, 
участников и сотрудников Cashblack или других лиц.
Мы можем предоставить Вашу личную информацию юридическим и физическим 
лицам, не связанным с Cashblack, если добросовестно полагаем, что эти лица вправе получать, 
использовать, хранить или раскрывать эту информацию на следующих основаниях:
 в целях обеспечения соблюдения требований законодательства, реализации судебных 
решений или исполнение их в принудительном порядке;
 по запросу государственных органов (сведения о количестве и типа таких запросов 
нами публикуются в Отчете о доступности сервисов и данных);
 в случае, если это в принудительном порядке обеспечивает соблюдение условий 
использования или при расследовании их возможных нарушений;
 в случае выявления мошенничества, с целью их пресечения или в случае, если такого 
рода запросы направлены на работу с целью устранения технических неполадок или проблем 
с безопасностью; 
 когда они защищают права, собственность или безопасность компании Cashblack, наших 
пользователей или общественности в соответствии с требованиями законодательства и на 
основании полномочий, предоставленных им законом.
Если компания Cashblack будет вовлечена в сделки по слиянию, поглощению или продаже 
активов, мы по-прежнему будем обеспечивать конфиденциальность всех персональных 
данных. Мы также уведомим всех заинтересованных пользователей в случае, если их личная 
информация будет передана другой организации или регулироваться иной политикой 
конфиденциальности.
3.4. Раскрытие информации другим лицам вследствие изменения контроля над 
сайтом Cashblack или его продажи
В случае изменения контроля или продажи Cashblack полностью или частично Cashblack может 
предоставить Ваши данные третьему лицу, которое получит право на использование такой 
информации в соответствии с положениями настоящей Политики.
Cashblack также может предоставить Ваши персональные данные третьему лицу при 
продаже активов Cashblack, а также при смене контроля над Компанией или одним из ее 
аффилированных лиц либо при подготовке к этим процедурам. Любое третье лицо, которому 
Cashblack передаст или продаст свои активы, получит право продолжить использование 
персональной и любой другой информации, предоставленной Вами в соответствии с 
положениями настоящей Политики.
4. Защита Ваших персональных данных
В соответствии с отраслевыми стандартами Cashblack реализует ряд мер, направленных на 
защиту Ваших данных.
Защита персональных данных наших Пользователей является одним из главнейших 
приоритетов для нас. В целях обеспечения защиты и с учетом требований, установленных 
Регламентом Европейского Союза за номером 2016/679 от 27.04.16 года, вступившим в силу 
25 мая 2018 года и направленным на предоставление заинтересованным лицам более 
надежного и эффективного контроля над своими данными, Cashblack обязуется соблюдать права 
всех Пользователей в соответствии с европейскими и любыми иными применимыми 
законами о персональных данных, на основании которых осуществляет свою деятельность 
Cashblack.
Мы делаем все возможное для того, чтобы обезопасить Cashblack и наших пользователей от 
несанкционированных попыток доступа, изменения, раскрытия или уничтожения 
хранящихся у нас данных. Помимо прочего, мы принимаем следующие меры:
 для обеспечения конфиденциальности данных при их передаче используем 
шифрование;
 применяем специальные средства защиты аккаунтов, например, такие как безопасный 
просмотр, проверка безопасности и двухэтапная аутентификация;
 для предотвращения несанкционированного доступа к нашей системе совершенствуем 
способы сбора, хранения и обработки данных;
 ограничиваем доступ к личной информации, в том числе нашим сотрудникам, а также 
накладываем на них строгие договорные обязательства, за нарушение которых 
предусмотрены санкции или увольнение.
5. Изменения в Политике
Cashblack может периодически вносить изменения в настоящую Политику 
конфиденциальности; в случае внесения существенных изменений Cashblack опубликует 
соответствующее уведомление на сайте, в приложениях и других службах (далее — Cashblack или 
«Услуги») либо иным способом уведомит Вас, чтобы Вы могли ознакомиться с 
изменениями, перед тем как продолжить работу с Cashblack. Если Вы не согласны с какими-либо 
изменениями, Вы можете удалить свой аккаунт. Продолжение работы с Cashblack после 
публикации или распространения уведомления о внесении изменений в данную Политику 
конфиденциальности означает, что Вы согласны с внесенными изменениями. 
6. Хранение данных
Мы храним и обрабатываем Ваши персональные данные на Серверах, находящихся в 
различных юрисдикциях на территории ЕС,где расположены наши представительства или 
поставщики услуг. 
Принимая условия настоящей Политики, Вы соглашаетесь на подобное перемещение, 
обработку и хранение данных. Мы предпринимаем все необходимые шаги для обеспечения 
надежной обработки Ваших персональных данных в соответствии с настоящей Политикой. 
Третьи стороны, которым могут быть переданы персональные данные для обеспечения 
функционирования наших Сервисов, могут быть расположены в других странах, где законы 
об обработке персональных данных могут быть менее жесткими, чем в Вашей стране. Время 
от времени персональные данные могут также храниться в других местах, и в таких случаях 
мы гарантируем, что персональные данные будут храниться и обрабатываться с должным 
уровнем защиты и безопасности.
В случае осуществления трансграничной передачи данных она проводится 
исключительно в соответствии с требованиями закона в такие юрисдикции и таким 
поставщикам, которые гарантируют поддержание уровня защиты персональных данных не 
ниже установленного в ЕС.
7. Файлы cookie
Cashblack использует файлы cookie для персонализации всех возможностей Cashblack и показа 
релевантных объявлений. Cashblack использует файлы cookie и аналогичные технологии, в том 
числе идентификаторы мобильных устройств с целью Вашей идентификации, повышения 
удобства работы с Cashblack, повышения безопасности, анализа использования услуг и показа 
объявлений. Когда Вы заходите на сайт, мы предлагаем Вам ознакомиться и принять наше 
использование файлов cookie. Принимая баннер и продолжая использование сайта, Вы 
соглашаетесь на размещение в Вашем браузере файлов cookie и веб-маяков в соответствии с 
положениями настоящей Политики.
8. Прочее
Cashblack постоянно работает над повышением качества Услуг и Продуктов, а это означает, 
что со временем могут быть реализованы новые способы сбора данных. Cashblack оставляет за 
собой право реализовать новые функции, некоторые из которых используются для сбора 
данных. В данном случае Вы будете дополнительно проинформированы о введенных 
изменениях.
9. Согласие на обработку персональных данных
При регистрации в сети Cashblack Вы соглашаетесь, что информация, указанная Вами в 
профиле, будет доступна другим Участникам и будет использоваться в соответствии с 
Политикой конфиденциальности и Пользовательским соглашением.
Предоставляя Cashblack персональные данные при создании или обновлении учетной записи 
и профиля, Вы добровольно и явным образом принимаете соглашение Cashblack. Предоставление 
информации в Cashblack, включая любую информацию, считающуюся конфиденциальной 
согласно применимому законодательству, является абсолютно добровольным. Всю полноту 
ответственности за ее достоверность несет лицо, регистрирующее аккаунт.
На данный момент, при создании личного кабинета, пользователь имеет ограниченный 
перечень способов взаимодействия с ним, а именно: он имеет возможность изменить свои 
данные, удалить контент и закрыть аккаунт.
Однако закрытие аккаунта не означает его удаление и удаление всех персональных 
данных, собранных о данном пользователе. Вам необходимо реализовать право 
зарегистрированного пользователя на отзыв данного ранее согласия путем удаления своего 
аккаунта, право незарегистрированного пользователя Приложения или сайта на удаление 
данных путем обращения к нам через службу поддержки или иным образом.
При входе в Приложение без регистрации учетной записи, мы предлагаем Вам принять 
условия настоящей Политики. Соглашаясь с этими условиями и продолжая использование 
Приложения, Вы предоставляете нам свое согласие на обработку персональных данных.
Данные о незарегистрированном пользователе могут быть удалены благодаря его 
идентификации в качестве уникального устройства (ПК, телефон и т.д.).
10. Сообщения и уведомления от Cashblack
Cashblack взаимодействует с Вами через отправку сообщений, электронных писем и иными 
способами. К примеру, Cashblack может отправлять Вам сообщения, связанные с доступностью 
услуг и продуктов, безопасностью и другими аспектами предоставления услуг и продуктов.
Для связи с Вами могут использоваться электронная почта, уведомления на нашем 
сайте, SMS-сообщения.
11. Ваша ответственность за хранение Идентификационного номера Cashblack и пароля
Вы отвечаете за сохранность Идентификационного номера Cashblack и пароля, которые Вы 
используете для получения доступа к нашим услугам и сервисам. Вы должны своевременно 
сообщать нам о возникающих у Вас подозрениях на незаконное использование Вашего 
Идентификационного номера Cashblack и пароля какими-либо лицами. Так как Ваш 
Идентификационный номер Cashblack и пароль являются уникальными, Вы признаете свою 
исключительную ответственность за частичное или полное пользование нашими услугами 
при помощи Вашего Идентификационного номера Cashblack.
12. Несовершеннолетние
Любое лицо, не достигшее 18 летнего возраста считается несовершеннолетним и не 
имеет права участвовать в маркетинг-плане компании Cashblack и получать денежное 
вознаграждение за рекомендацию услуг Компании. Пользователь несет личную 
ответственность за нарушение данного пункта, а также за введение в заблуждение Компанию 
относительно своего возраста путем внесения ложных сведений при регистрации.
13. Контент
На Вас возлагается ответственность за любую информацию, опубликованную Вами на 
нашем сайте, и эта информация будет доступна другим участникам.
Если Вы делитесь контентом на сайте либо импортируете блог или другие данные, Вам 
следует учитывать, что публикуемые данные могут быть прочитаны, собраны или 
использованы другими Участниками соответствующих форумов, разработчиками и 
сторонними организациями.
Cashblack не несет ответственности за информацию, которую Вы размещаете на этих 
форумах. Контент в группах Cashblack может быть общедоступен для просмотра и поиска через 
интернет. Другие участники могут скопировать и использовать опубликованные Вами 
сведения.
14. Права и обязанности участника
14.1. Право на управление персональными данными и на закрытие аккаунта
Вы можете изменить свои данные в Cashblack App в любой момент, отредактировав свой 
аккаунт. Вы также можете запросить дополнительные сведения о своей учетной записи, 
которыми может располагать Cashblack.
14.2. Вы можете удалять информацию из своего аккаунта, а также экспортировать ее, 
если Вам нужная копия или Вы хотите использовать эти данные в другом сервисе.
Удалить информацию можно следующими способами:
- удалить определенные материалы из аккаунта с помощью настроек;
- полностью удалить свой аккаунт.
Наконец, наше Приложение может предоставить другому лицу доступ к определенным 
функциям Вашего аккаунта, что может пригодиться, если по каким-либо причинам Вы не 
сможете выполнить вход.
14.3. Даже если Вы не вошли в свой аккаунт, Вы все равно можете в некоторой мере 
контролировать, какие данные о Вас мы собираем. К ним относятся следующее:
- настройки браузера. Например, Вы можете указать, чтобы при сохранении файла 
cookie появлялось уведомление, или запретить сохранять cookie-файлы. Однако имейте в 
виду, что такого рода файлы необходимы для корректной работы нашего Приложения, 
например, чтобы Вам не приходилось каждый раз указывать язык и другие параметры.
- настройки на уровне устройства. На Вашем компьютере, смартфоне или планшете 
могут быть предусмотрены собственные настройки сбора данных. Например, устройства 
Android позволяют указывать как следует обрабатывать информацию о Вашем 
местоположении.
14.4. Вы в любой момент можете отовать свое согласие на обработку персональных 
данных и удалить свой аккаунт.
14.5. Вы обладаете также правом направить жалобу о нарушении Ваших прав нам или 
соответствующему контролирующему органу по месту Вашего нахождения.
14.6. Вы имеете право на предоставление полной инфорации о собираемых и 
передаваемых Ваших персональных данных.
14.7. В случае необходимости, Вы можете потребовать от нас переноса третьему ицу 
всех Ваших персональных данных.
14.8. В исключительных случаях, предусмотренных законом, Вы обладаете правом на 
приостановку обработки персональных данных.
15. Обязанности Участника
Вы обязаны соблюдать положения Пользовательского соглашения.
Являясь участником, Вы имеете определенные обязанности по отношению к другим 
участникам. Некоторые из этих обязанностей определены соответствующим 
законодательством и нормативными актами.
Вы обязаны соблюдать все условия и положения настоящей Политики 
конфиденциальности, Пользовательского соглашения. В том числе необходимо соблюдать 
все права на интеллектуальную собственность (например, товарные знаки или фотографии), 
которые могут принадлежать третьим лицам.
Вы не вправе загружать или иным образом распространять какую-либо информацию, 
которая может нарушать права других участников либо может расцениваться как опасная, 
пропагандирующая насилие, оскорбительная, пропагандирующая расизм или ксенофобию, а 
также любым образом противоречащую цели и духу Cashblack.
Вы обязаны держать в секрете и не сообщать другим лицам учетные данные (адрес 
электронной почты и пароль), используемые для входа в систему.
В случае несоблюдения указанных выше обязанностей функционирование аккаунта 
может быть ограничено, приостановлено или прекращено Cashblack в одностороннем порядке.
16. Сохранение данных
Cashblack сохраняет Ваши данные до тех пор, пока Ваша учетная запись активна либо пока 
это необходимо. Например, Cashblack может хранить определенную информацию даже после 
удаления учетной записи, если это необходимо для исполнения требований 
законодательства, разрешения споров, предотвращения мошенничества или 
злоупотреблений, а также для обеспечения положений настоящей Политики.
Cashblack сохраняет персональные данные, предоставленные Вами, пока Ваша учетная 
запись существует либо пока это необходимо для предоставления Вам услуг. Cashblack может 
сохранить Ваши персональные данные даже после закрытия учетной записи, если это 
необходимо для исполнения требований законодательства, разрешения споров между 
участниками, предотвращения мошенничества или злоупотреблений, а также для 
обеспечения положений настоящей Политики. Cashblack может хранить персональные данные в 
течение ограниченного периода времени в соответствии с требованиями законодательства. 
Служба поддержки Cashblack может сохранять информацию так долго, как это необходимо для 
получения отчетов и анализов относительно работы данной службы. Персональные данные 
пользователей, не выполнивших вход в учетную запись, хранятся в течение 12 месяцев с 
целью анализа поведенческой деятельности. В данном случае идентификация данных таких 
пользователей привязана к устройству, с которого пользователь заходит в Приложение. 
Хранение персональных данных таких пользователей прекращается с удалением 
Приложения.
17. Важная информация
17.1. Внесение изменений в Политику конфиденциальности
Cashblack будет уведомлять Вас о внесении изменений в настоящую Политику
конфиденциальности.
Cashblack может периодически вносить изменения в настоящую Политику 
конфиденциальности. В случае внесения существенных изменений, связанных с обработкой 
персональных данных либо Политикой конфиденциальности, Вы можете ознакомиться с 
оными на официальном сайте. Рекомендуется внимательно изучить внесенные изменения. 
Если Вы не согласны с какими-либо изменениями и не желаете использовать Cashblack App в 
дальнейшем, Вам следует закрыть свой аккаунт. Если не указано иное, настоящая Политика 
конфиденциальности распространяется на все данные о Вас и Вашей учетной записи, 
которыми располагает Cashblack.
17.2. Ответственность и уведомление о нарушении
Cashblack серьезно относится к вопросам безопасности и конфиденциальности, тем не 
менее, Вы должны помнить, что интернет является небезопасной средой, проявлять 
осторожность и использовать только надежные пароли. Нет никаких гарантий, что 
информация не будет просмотрена, раскрыта, изменена или уничтожена вследствие отказа 
или преодоления каких-либо физических, технических и административных мер защиты. Вы 
несете ответственность за обеспечение безопасности своих учетных данных. Электронные 
письма, мгновенные сообщения и аналогичные средства связи с другими участниками Cashblack 
не шифруются, поэтому передавать с их помощью конфиденциальную информацию не 
рекомендуется. Для обеспечения безопасности учетной записи рекомендуется использовать 
надежный пароль. Мы ответственно относимся к безопасности Ваших персональных данных, 
в случае утечки персональных данных, в силу действующих норм, мы в течение 72 часов 
известим контролирующие органы. В случае возникновения такой ситуации, Вы будете 
также незамедлительно оповещены. 
''';

  @override
  Widget build(BuildContext context) {
    return Center(
      child: TextButton(
        onPressed: () {
          showModalBottomSheet(
            // isScrollControlled: true,
            // enableDrag: true,
            context: context,
            builder: (context) {
              return Container(
                margin: const EdgeInsets.symmetric(
                  vertical: 20,
                  horizontal: 16,
                ),
                height: double.infinity,
                width: double.infinity,
                child: ListView(
                  children: [
                    const SizedBox(height: 6),
                    const Text(
                      'Условия оферты',
                      style: TextStyle(
                        fontSize: 22,
                        fontWeight: FontWeight.bold,
                      ),
                    ),
                    const SizedBox(height: 6),
                    Text(
                      text,
                      textAlign: TextAlign.justify,
                      style: const TextStyle(
                        fontSize: 16,
                      ),
                    ),
                    TextButton(
                      onPressed: () {
                        Navigator.pop(context);
                      },
                      child: const Text('OK'),
                    ),
                  ],
                ),
              );
            },
          );
        },
        child: Text(
          'условия оферты',
          style: TextStyle(
            fontSize: fontSize,
          ),
        ),
      ),
    );
  }
}
